app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG','PG-13','R'))  ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG','PG-13','R'))  ORDER BY "movies"."release_date" ASC
---
    def index
      @all_ratings = Movie.all_ratings
      if !params[:ratings].present? && session[:checked_ratings].present? && !params['sort'].present? && session['sort'].present?
        redirect_to movies_path({ratings: session[:checked_ratings], 'sort': session[:sort]})
      else
        if params[:ratings].present?
          @ratings_to_show = params[:ratings].keys
        else
          @ratings_to_show = Movie.all_ratings
        end
        @movies = Movie.with_ratings(@ratings_to_show)
        if params['sort'] == 'title'
          @sort = 'title'
          @movies = Movie.with_ratings(@ratings_to_show).order(:title)
        elsif params['sort'] == 'date'
          @sort = 'date'
          @movies = Movie.with_ratings(@ratings_to_show).order(:release_date)