app/controllers/movies_controller.rb

    def index
      @movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE (rating IN 'G','PG','PG-13','R')